---
title: ReleaseConditions
classe: Autodesk.Revit.DB.Structure.ReleaseConditions
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 9
---

# ReleaseConditions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean Fx { get; set; }` | `releaseConditions.Fx` | Boolean |
| `Boolean Fy { get; set; }` | `releaseConditions.Fy` | Boolean |
| `Boolean Fz { get; set; }` | `releaseConditions.Fz` | Boolean |
| `Boolean IsValidObject { get; }` | `releaseConditions.IsValidObject` | Boolean |
| `Boolean Mx { get; set; }` | `releaseConditions.Mx` | Boolean |
| `Boolean My { get; set; }` | `releaseConditions.My` | Boolean |
| `Boolean Mz { get; set; }` | `releaseConditions.Mz` | Boolean |
| `Boolean Start { get; set; }` | `releaseConditions.Start` | Boolean |
| `Void Dispose()` | `releaseConditions.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```